# Shell essentials
brew "antidote"
brew "starship"
brew "zoxide"
brew "thefuck"
brew "fzf"

# Editor
brew "neovim"

# Git
brew "git-lfs"
brew "gh"
brew "lazygit"
brew "git-delta"
brew "pre-commit"
brew "gitleaks"

# Runtime management
brew "mise"

# Search
brew "ripgrep"
brew "fd"

# Shell utilities
brew "bat"
brew "eza"
brew "tree"
brew "direnv"
brew "jq"

# Linting and formatting
brew "shellcheck"
brew "shfmt"
brew "go-jsonnet"

# Cloud and infrastructure
brew "awscli"
brew "terraform"
brew "kubernetes-cli"
brew "helm"
brew "k9s"

# Utilities
brew "chezmoi"
brew "tmux"
brew "uv"

# Casks
cask "ghostty"
cask "1password-cli"
cask "gcloud-cli"
