# Shell essentials
brew "antidote"
brew "starship"
brew "zoxide"
brew "thefuck"
brew "fzf"

# Editor
brew "neovim"

# Git
brew "git-lfs"
brew "gh"
brew "lazygit"
brew "git-delta"
brew "pre-commit"
brew "gitleaks"

# Runtime management
brew "mise"

# Search
brew "ripgrep"
brew "fd"

# Shell utilities
brew "bat"
brew "eza"
brew "tree"
brew "direnv"
brew "jq"
brew "trash-cli"
brew "atuin"

# Modern CLI tools
brew "dust"
brew "duf"
brew "sd"
brew "btop"
brew "procs"
brew "xh"
brew "doggo"
brew "choose-rust"
brew "gping"
brew "hyperfine"
brew "tokei"
brew "yazi"
brew "lazydocker"
brew "trippy"
brew "grex"
brew "navi"
brew "tealdeer"
brew "wget"
brew "bandwhich"

# Linting and formatting
brew "actionlint"
brew "selene"
brew "shellcheck"
brew "shfmt"
brew "stylua"
brew "go-jsonnet"

# Cloud and infrastructure
brew "awscli"
brew "terraform"
brew "kubernetes-cli"
brew "helm"
brew "k9s"

# Utilities
brew "chezmoi"
brew "tmux"
brew "uv"

# Casks
cask "ghostty"
cask "1password-cli"
cask "claude-code"
cask "gcloud-cli"
